# corrections.py

COMMON_CORRECTIONS = {

    # =====================================================
    # COMMON SINHALA ASR ERRORS
    # =====================================================

    "කථාව": "කතාව",

    "ජීවිදය": "ජීවිතය",

    "සබ්කරයිප්": "සබ්ස්ක්‍රයිබ්",

    "සබ්කරීප්": "සබ්ස්ක්‍රයිබ්",

    "උගුස්සා": "උකුස්සා",

    "ශක්තිය": "සක්තිය",

    "භාෂාව": "බාෂාව",

    "දෑග්ගක්": "තෑග්ගක්",

    "මාරගහ": "මාර ගහ",

    "හිසිම": "කිසිම",

    "දුබල": "දුර්වල",

    "කූලග": "කුළඟ",

    "උණපඟුර": "උණ පඳුර",

    "ශර්ථාය": "ශක්තිය",

    "ජීවිතයට": "ජීවිතයට",

    "එවගේම": "එවගේම",

    "ඉතිං": "ඉතින්",

    "පස්සේ": "පස්සෙ",

    "කියනවා": "කියනවා",

    "සබ්ස්ක්කරල්ල": "සබ්ස්ක්‍රයිබ්"
    
}